Revit 2027 API
BuiltInFailures.ParameterFailures Class
 Failures related to parameters and parameter operations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ParameterFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ParameterFailures
Public NotInheritable Class ParameterFailures
public ref class ParameterFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ParameterFailures = class end
The BuiltInFailures.ParameterFailures type exposes the following members.
Properties
Name | Description
InconsistentSharedParameterDefinitions |  The shared parameter '...' cannot be added with name '...' and type '...' because it conflicts with the existing name '...' and type '...'.
UnrecognizedSharedParameterDataType |  The shared parameter '...' with name '...' cannot be added because its data type is not recognized.
Top
See Also
Reference
Autodesk.Revit.DB Namespace